Repository: mmrm11/48764011D
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: It would also mean that friends and parents have different roles to play as regards to the behaviors of children.
es_es: También significa que los amigos y los padres desempeñan papeles diferentes en el comportamiento de los hijos.

source: Learn more
es_es: Saber más

source: Levine, Smolak, Moodey, Shuman, and Hessen conducted a similar study in the United States in 1994.
es_es: Levine, Smolak, Moodey, Shuman y Hessen realizaron un estudio similar en Estados Unidos en 1994.

source: Male characters are mostly illustrated as strong and muscular warriors; female characters are also frequently involved in fight scenes.
es_es: La mayoría de los personajes masculinos son guerreros fuertes y musculosos; las mujeres también participan con frecuencia en escenas de lucha.

source: Markey and Markey (2010) stated that at the start of the twentieth century, body image studies initially focused on personality or self-concept and frequently scrutinized samples of psychologically impeded or if not psychologically ailing or impaired individuals’ sense of self (not essentially their physical body).
es_es: Markey and Markey (2010) declararon que a comienzos del siglo XX, las investigaciones de la imagen corporal, inicialmente, se centraban en la personalidad o el autoconcepto, y con frecuencia, analizaban muestras del sentido del yo (no esencialmente de su cuerpo físico) de individuos psicológicamente impedidos o, si no, psicológicamente enfermos o deteriorados.

source: McCabe and Ricciardelli (2004) observed that mothers and the best female friends influence the behavior of girls regarding their body images.
es_es: McCabe y Ricciardelli (2004) observaron que las madres y las mejores amigas influyen en el comportamiento de las chicas con respecto a su imagen corporal.

source: Media Influence
es_es: La influencia de las redes sociales

source: Media Influence on Children’s and Teens’ Body Image
es_es: La influencia de las redes sociales en la imagen corporal de los niños y adolescentes

source: Media Message
es_es: Mensaje de los medios de comunicación

source: Media Resources Influencing Kids’ Behavior
es_es: Recursos mediáticos que influyen en el comportamiento de los niños

source: Media has promoted the beauty ideal that is hardly achievable for ordinary people.
es_es: Las redes sociales han fomentado el ideal de belleza que es difícilmente alcanzable para la gente normal.

source: Media have become an inseparable part of everyday life; it is present everywhere – at home, at work, in the street, etc.
es_es: Las redes sociales se han convertido en una parte inherente de la vida diaria; está en todas partes, en casa, en el trabajo, en la calle, etc.

source: Media resources provide vivid example where thin and beautiful characters are always rewarded with love, money, or career while ugly individuals express jealousy and dissatisfaction with life challenges.
es_es: Los medios de comunicación ofrecen claros ejemplos en los que los personajes delgados y guapos siempre son recompensados con amor, dinero o una carrera, mientras que los feos expresan celos e insatisfacción ante los retos de la vida.

source: Men of all ages, nationalities, and sexual orientations desire this ideal masculine physique (Ryan & Morrison, 2009).
es_es: Hombres de todas las edades, nacionalidades y orientaciones sexuales desean este físico masculino ideal (Ryan & Morrison, 2009).

source: Millions of people spend hours in front of their TVs watching shows, observing new fashion trends, and listening to the broadcast ideas and concepts.
es_es: Millones de personas pasan horas delante de la televisión viendo programas, observando las nuevas tendencias de la moda, y escuchando las ideas y conceptos emitidos.

source: Moreover, 13% of girls admitted engaging in at least one extreme behavior for weight losing per week (Paxton et al., 1991).
es_es: Además, el 13% de las niñas admitió tener al menos un comportamiento extremo para perder peso a la semana (Paxton et al., 1991).

source: Moreover, adoration of the beauty of the female body is a historical trend observed by many authors and researchers, which indicates that both girls and boys are subjected to beauty ideals via the media and popular culture that dictates what their bodies should look like.
es_es: Además, la adoración de la belleza del cuerpo femenino es una tendencia histórica observada por muchos autores e investigadores, que indica que tanto las chicas como los chicos están sometidos a ideales de belleza a través de los medios de comunicación y la cultura popular que dictan cómo deben ser sus cuerpos.

source: Moreover, parents influence their children regarding adolescence depression, eating disarray, and general well-being.
es_es: Además, los padres influyen en sus hijos en lo que respecta a la depresión en la adolescencia, el desorden alimentario y el bienestar general.

source: Moreover, television does not require additional knowledge or skills like reading necessary for magazine advertising.
es_es: Además, la televisión no requiere conocimientos o habilidades adicionales como la lectura, necesaria para la publicidad en revistas.

source: Most of the children’s favorite shows aired on Nickelodeon and Disney Channel promote thinness as a beauty standard and emphasize the necessity of possessing physical attractiveness.
es_es: La mayoría de los programas favoritos de los niños emitidos en Nickelodeon y Disney Channel promueven la delgadez como estándar de belleza y hacen hincapié en la necesidad de poseer un atractivo físico.

source: Most of the media content illustrates females in different sexual roles whose peculiar features are thin bodies, long legs, big breast, etc.
es_es: La mayor parte del contenido de los medios ilustra a mujeres en diferentes roles sexuales cuyas características peculiares son cuerpos delgados, piernas largas, pechos grandes, etc.

source: Mothers and Daughters: A Critical Bond
es_es: Madres e hijas: Un vínculo crítico

source: Mothers manipulate the body images of their children through developing negative or positive feelings.
es_es: Las madres manipulan la imagen corporal de sus hijos desarrollando sentimientos negativos o positivos.

source: Mothers who are concerned about their own health would always influence their children since they would urge them to develop ideal bodies that would be admired by each person in society.
es_es: Las madres que se preocupan por su propia salud siempre influyen en sus hijas, ya que las instan a desarrollar cuerpos ideales que sean admirados por todos los miembros de la sociedad.

source: Mothers would communicate to their daughters in a manner suggesting that they ought to possess certain body images.
es_es: Las madres comunican a sus hijas y les sugieren que deben tener una determinada imagen corporal.

source: Mothers would do this through various means such as teasing, pressurizing daughters to abandon some form of behaviors, and restricting their children on some forms of food.
es_es: Las madres lo hacen por diversos medios, como burlándose de ellas, presionándolas para que abandonen ciertos comportamientos y restringiéndoles el consumo de ciertos alimentos.

source: Motivation plays the crucial role in provoking behavior imitations with the learner; punishment and reinforcement are the key components of motivation.
es_es: La motivación desempeña un papel crucial a la hora de provocar imitaciones de conducta en el alumno; el castigo y el refuerzo son los componentes clave de la motivación.

source: Music shows and programs about music celebrities also occupy a considerable sector at broadcasting time.
es_es: Los espectáculos musicales y los programas sobre los famosos en el mundo de la música también ocupan un sector considerable en el tiempo de emisión.

source: Negative comments affect girls in a negative way because they might start engaging in practices that are harmful to their normal growth.
es_es: Los comentarios negativos afectan negativamente a las niñas porque podrían empezar a realizar prácticas perjudiciales para su crecimiento normal.

source: Nerveless, it is impossible to eliminate its impact on boys’ body image.
es_es: Sin embargo, es imposible eliminar su impacto en la imagen corporal de los chicos.

source: Nevertheless, male ideals of body image also exist, which are reinforced by various media.
es_es: Sin embargo, también existen ideales masculinos de imagen corporal, que se ven reforzados por diversos medios de comunicación.

source: No much attention is paid to the issue of slenderness thus, men and boys are less vulnerable to the obsession with body image that women and girls (Ryan & Morrison, 2009).
es_es: No se presta mucha atención a la cuestión de la delgadez, por lo que los hombres y los niños son menos vulnerables a la obsesión por la imagen corporal que las mujeres y las niñas (Ryan & Morrison, 2009).

source: Northup and Liebler (2010) cited that 50% of the contemporary dieting girls are of normal weight, and 62% of girls in general want to have thinner bodies.
es_es: Northup y Liebler (2010) citaron que el 50% de las chicas contemporáneas que hacen dieta tienen un peso normal, y el 62% de las chicas en general desean tener cuerpos más delgados.

source: Northup and Liebler (2010) identified six major beauty ideals proposed and promoted by the contemporary media – classic, trendy, athletic, brainy, next-door girl, and alternative.
es_es: Northup y Liebler (2010) identificaron seis grandes ideales de belleza propuestos y promovidos por los medios de comunicación contemporáneos: clásico, moderno, atlético, inteligente, chica de al lado y alternativo.

source: Older children also have a number of problems with the adequate assessment of their body image (Hayes & TantIeff-Dunn, 2010).
es_es: Los niños mayores también tienen una serie de problemas con la evaluación adecuada de su imagen corporal (Hayes & TantIeff-Dunn, 2010).

source: On the other hand, various socializing agents are responsible for the behaviors possessed by children.
es_es: Por otra parte, diversos agentes socializadores son responsables de los comportamientos que poseen los niños.

source: On their part, girls would undertake all steps to ensure that they lose weight to attain the recommended body sizes.
es_es: Por su parte, las chicas hacen todo lo posible para perder peso y alcanzar las tallas recomendadas.

source: On this basis, Bandura determined three models of learning through observations – a live model, a symbolic model, and a verbal instructional one.
es_es: Sobre esta base, Bandura determinó tres modelos de aprendizaje a través de la observación: un modelo vivo, un modelo simbólico y uno instructivo verbal.

source: One of Bandura’s experiments concerned a Bobo doll expressing aggressive ways of conduct.
es_es: Uno de los experimentos de Bandura se refería a un muñeco Bobo que expresaba formas agresivas de conducta.

source: One of the most popular and thus, powerful components of media is television.
es_es: Una de las redes sociales más populares y, por lo tanto, más poderosa, es la televisión.

source: One of the most popular commercial networks Nickelodeon provides a vast amount of television, internet, and video production emphasize girls’ powerful position in civil and consumer worlds.
es_es: Una de las redes comerciales más populares, Nickelodeon, ofrece una gran cantidad de producciones de televisión, Internet y vídeo que hacen hincapié en la poderosa posición de las niñas en el mundo civil y del consumo.

source: Over the past years, researchers have tried to investigate how the relationship between parents and their children is reflected in the development of companionship (Johnson, 2001).
es_es: En los últimos años, los investigadores han tratado de investigar cómo la relación entre padres e hijos se refleja en el desarrollo del compañerismo (Johnson, 2001).

source: Parental encouragement of activities aimed at losing weight and keeping to a diet is likely to provoke body dissatisfaction among their children (Markey, & Markey 2010).
es_es: El estímulo de los padres a las actividades destinadas a perder peso y mantener una dieta puede provocar insatisfacción corporal entre sus hijos (Markey, & Markey2010).

source: Paxton, Wertheim, Gibbons, Szmukler, Hillier, & Petrovich, (1991) conducted a survey of 221 male and 341 female high school students.
es_es: Paxton, Wertheim, Gibbons, Szmukler, Hillier y Petrovich (1991) realizaron una encuesta entre 221 alumnos y 341 alumnas de secundaria.

source: Peer communication also contributes to shaping adolescents’ feelings and perceptions of their bodies.
es_es: La comunicación entre compañeros también contribuye a moldear los sentimientos y percepciones de los adolescentes sobre sus cuerpos.

source: Peer pressure among youths is known to transform group norms and standards (Musher-Eizenman, Holub, Edwards-Leeper, Persson, & Goldstein, 2003).
es_es: Se sabe que la presión de los iguales entre los jóvenes transforma las normas y los estándares del grupo (Musher-Eizenman, Holub, Edwards-Leeper, Persson y Goldstein, 2003).

source: Peer pressure is an important variable as far as body image of children is concerned.
es_es: La presión de los iguales es una variable importante en lo que respecta a la imagen corporal de los niños.

source: Peers have their own methods of ensuring that group members abide by the set rules and regulations.
es_es: Los compañeros tienen sus propios métodos para asegurarse de que los miembros del grupo acatan las reglas y normas establecidas.

source: Pierson and Cohen (2003) posited that mothers perceived to be slim would still want to lose weight to attain the BMI index.
es_es: Pierson y Cohen (2003) postularon que las madres percibidas como delgadas seguirán queriendo adelgazar para alcanzar el índice IMC.

source: Popular culture implies that women should be feminine while men should be masculine.
es_es: La cultura popular dicta que las mujeres deben ser femeninas mientras que los hombres deben ser masculinos.

source: Preadolescent and an adolescent girl audience are taught that successful and powerful women should also be slim and attractive (Banet-Weiser, 2004).
es_es: Al público preadolescente y adolescente femenino, se le enseña que las mujeres de éxito y poderosas también deben ser delgadas y atractivas (Banet-Weiser, 2004).

source: Preschool children learn that fatness in women is not acceptable.
es_es: Los niños en edad preescolar aprenden que el sobrepeso en las mujeres no es aceptable.

source: Preschool children spend approximately 3.5 hours in front of their TVs per day.
es_es: Los niños en edad preescolar pasan aproximadamente 3,5 horas al día delante del televisor.

source: Quite a number of researchers illustrate that the quality of relationships between adolescents and parents are complex.
es_es: Numerosos investigadores ilustran que la calidad de las relaciones entre adolescentes y padres es compleja.

source: Ramifications for Mothers, Daughters, and Families
es_es: Consecuencias para madres, hijas y familias

source: Recent models, such as the Bowlby’ lifetime model, hypothesize that attachment and connectedness to parental figures among children is productive to growth and development of children.
es_es: Los modelos más recientes, como el modelo de Bowlby para toda la vida, plantean la hipótesis de que el apego y la conexión con las figuras parentales entre los niños es productivo para el crecimiento y el desarrollo de los niños.

source: Recent researchers show the rapid increase in eating disorders among young children reflected in binge eating, negative body image, abuse of diet pills, diuretics, and laxatives, over exercising, and restrictive dieting.
es_es: Investigadores recientes muestran el rápido aumento de los trastornos alimentarios entre los niños pequeños, que se refleja en atracones, imagen corporal negativa, abuso de pastillas para adelgazar, diuréticos y laxantes, exceso de ejercicio y dietas restrictivas.

source: Recent studies show that the family influences largely the health of a child.
es_es: Estudios recientes demuestran que la familia influye en gran medida en la salud de un niño.

source: Regarding body image, the media plays a crucial role since it portrays certain body figures to be significant as opposed to others.
es_es: En cuanto a la imagen corporal, los medios de comunicación desempeñan un papel crucial, ya que presentan ciertas figuras corporales como significativas en comparación con otras.

source: Regarding the influence of peers on the body image of children, it is established that eating malfunctions and attempts to control the diet are related to the maturation and the desire to hang out with members of opposite sex.
es_es: En cuanto a la influencia de los compañeros en la imagen corporal de los niños, se establece que las disfunciones alimentarias y los intentos de controlar la dieta están relacionados con la maduración y el deseo de salir con miembros del sexo opuesto.

source: Regular observations of slim models arouse dissatisfaction with body proportions possessed by girls and women of average/normal size due to their inability to achieve impossible beauty standards broadcast in media (Fauquet, 2010).
es_es: La observación habitual de modelos delgadas despierta insatisfacción con las proporciones corporales que poseen las niñas y mujeres de talla media/normal debido a su incapacidad para alcanzar los estándares de belleza imposibles que difunden los medios de comunicación (Fauquet, 2010).

source: Regular peer interactions dedicated to the issues of beauty and appearance cause lead to the development of unwanted human behavior, which would lead to body dissatisfaction.
es_es: Interacciones regulares entre compañeros dedicadas a las cuestiones de belleza y apariencia causan el desarrollo de un comportamiento humano no deseado, lo que llevaría a la insatisfacción corporal.

source: Research on Children’s and Youth’s Body Image Dissatisfaction
es_es: Investigación acerca de la insatisfacción con la imagen corporal de niños y jóvenes

source: Research reported that 13% of the 10th grade students try to emulate some behaviors that would help them develop desired body shapes such, by using laxatives and diuretics.
es_es: Las investigaciones informaron que el 13% de los estudiantes de 10º grado tratan de emular algunos comportamientos que les ayudarían a desarrollar las formas corporales deseadas, como el uso de laxantes y diuréticos.

source: Research shows that body dissatisfaction among girls start at a tender age and goes on to maturity.
es_es: Las investigaciones demuestran que la insatisfacción corporal de las niñas comienza a una edad temprana y se prolonga hasta la madurez.

source: Research shows that mothers should be attentive to the messages they sent to their daughters regarding body images since such messages might affect their children either positively or negatively.
es_es: Las investigaciones demuestran que las madres deberían estar atentas a los mensajes que envían a sus hijas en relación con la imagen corporal, ya que dichos mensajes podrían afectar a sus hijas positiva o negativamente.

source: Research shows that nothing has changed since the mother is still depended upon to fulfill some of the domestic roles.
es_es: Las investigaciones demuestran que nada ha cambiado, ya que se sigue dependiendo de la madre desempeñar algunas de las funciones domésticas.

source: Results of Media Influence
es_es: Resultados de la influencia de los medios

source: Right from childhood, the child would be introduced to the ideals of perfect body images, which would give him or her desire to explore more.
es_es: Desde la infancia, el niño es introducido a los ideales de imágenes corporales perfectas, lo que le da el deseo de explorar más.

source: Ryan and Morrison (2009) referred to a number of publications revealing recent increased interest to men’s body due to the expansion of media resources.
es_es: Ryan y Morrison (2009) se refirieron a una serie de publicaciones que revelan el reciente aumento del interés por el cuerpo de los hombres debido a la expansión de los recursos mediáticos.

source: She is often illustrated in glasses and modest clothes, and she is never an object of romance.
es_es: Suele aparecer con gafas y ropa modesta, y nunca es objeto de romanticismo

source: Similarly, the formation of intimate relationships is salient, together with the development of contacts with same sex friends.
es_es: Del mismo modo, la formación de relaciones íntimas es destacada, junto con el desarrollo de contactos con amigos del mismo sexo.

source: Since children are unable to achieve desired physical proportions, they would probably forfeit eating in order to become seemingly beautiful and attractive.
es_es: Ya que los niños no son capaces de conseguir las proporciones físicas deseadas, probablemente dejen de comer para poder ser supuestamente atractivos.

source: Since every woman starting from her early ages wants to be liked, such a depiction of women may provoke the establishment of wrong life values.
es_es: Dado que toda mujer, desde su más tierna edad, desea gustar, esta representación de la mujer puede provocar el establecimiento de valores vitales erróneos.

source: Social Leaning Theory of Albert Bandura
es_es: Teoría del Aprendizaje Social de Albert Bandura:

source: Some children have battled with dieting problems in their lives, leading to complications such as obese.
es_es: Algunos niños han luchado con problemas de dieta en su vida, lo que les ha llevado a complicaciones como la obesidad.

source: Some girls would even use dangerous drugs to achieve the ideal body size.
es_es: Algunas chicas incluso utilizarían drogas peligrosas para conseguir la talla corporal ideal.

source: Some models of family functioning, such as psychoanalytic model, postulate that detachment among children is a normal developmental indicator of parent-child relationship during adolescence.
es_es: Algunos modelos de funcionamiento familiar, como el modelo psicoanalítico, postulan que el desapego entre los hijos es un indicador normal del desarrollo de la relación padre-hijo durante la adolescencia.

source: Some mothers are fat and they would justify their body images by convincing their daughters that such bodies have their some merits.
es_es: Algunas madres son gordas y justifican su imagen corporal convenciendo a sus hijas de que ese cuerpo tiene sus méritos.

source: Some scholarly sources indicate that even higher rates of dissatisfaction are encountered among the children’s peers.
es_es: Algunas fuentes académicas indican que los índices de insatisfacción son aún mayores entre los compañeros de los niños.

source: Some scholars have suggested different views that explain the influence of body sizes to the lives of children.
es_es: Algunos estudiosos han sugerido diferentes puntos de vista que explican la influencia de las tallas corporales en la vida de los niños.

source: Some scholars, such as Archibald, Graber, and Brooks-Gunn (1999) observed that even though parents play an important role in the lives of young adolescents, their presence in the lives of children is still valid as far as self-perception is concerned.
es_es: Algunos estudiosos, como Archibald, Graber y Brooks-Gunn (1999) observaron que, aunque los padres desempeñan un papel importante en la vida de los jóvenes adolescentes, su presencia en la vida de los hijos sigue siendo válida en lo que respecta a la autopercepción.

source: Some use unscrupulous techniques such as those that facilitate vomiting.
es_es: Algunos usan técnicas poco escrupulosas como las que facilitan el vómito.
